```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # module.provision_apps[0].helm_release.coredns will be updated in-place
  ~ resource "helm_release" "coredns" {
      ~ id                         = "kube-coredns" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "1.12.3" -> (known after apply)
          ~ chart          = "coredns" -> (known after apply)
          ~ first_deployed = 1750693994 -> (known after apply)
          ~ last_deployed  = 1754758816 -> (known after apply)
          ~ name           = "kube-coredns" -> (known after apply)
          ~ namespace      = "kube-system" -> (known after apply)
          ~ notes          = <<-EOT
                CoreDNS is now running in the cluster as a cluster-service.
                
                It can be tested with the following:
                
                1. Launch a Pod with DNS tools:
                
                kubectl run -it --rm --restart=Never --image=infoblox/dnstools:latest dnstools
                
                2. Query the DNS server:
                
                / # host kubernetes
            EOT -> (known after apply)
          ~ revision       = 4 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - deployment          = {
                      - enabled = true
                    }
                  - k8sAppLabelOverride = "kube-dns"
                  - podDisruptionBudget = {
                      - minAvailable = 1
                    }
                  - prometheus          = {
                      - monitor = {
                          - enabled = true
                        }
                      - service = {
                          - annotations = {
                              - "prometheus.io/port"   = "9153"
                              - "prometheus.io/scrape" = "true"
                            }
                          - enabled     = true
                        }
                    }
                  - replicaCount        = 3
                  - service             = {
                      - clusterIP = "(sensitive value)"
                    }
                }
            ) -> (known after apply)
          ~ version        = "1.43.2" -> (known after apply)
        } -> (known after apply)
        name                       = "kube-coredns"
      ~ version                    = "1.43.2" -> "1.43.3"
        # (27 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```